//HERC01XX JOB (PROJ5),
//             'EXECUTA PROJ5',
//             CLASS=C,
//             MSGCLASS=X,
//             REGION=8M,TIME=1440,
//             MSGLEVEL=(1,1),NOTIFY=HERC01
//COMPILA  EXEC COBOL,
//         PROG='PROJ5',
//         BIBF='HERC01.COBOL',
//         BIBC='HERC01.LOAD'
